#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/8610c0f3-db29-471f-9a7a-e79203787193/terraform-bin plan -out=tfplan -no-color
module.vpc.aws_route_table_association.public[1] (deposed object ee19b1ca): Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]
aws_cloudwatch_log_group.ecs_app: Refreshing state... [id=/ecs/aidoctors-app]
module.ecr_app.data.aws_partition.current: Reading...
module.vpc.aws_nat_gateway.this[1] (deposed object 835aab7e): Refreshing state... [id=nat-060795adfd71d2087]
aws_cloudwatch_log_group.ecs_datapipeline: Refreshing state... [id=/ecs/aidoctors-datapipeline]
module.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z07552261L3Y3JSSNSTHB]
module.s3_alb_logs.data.aws_partition.current: Reading...
module.ecr_pipeline.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]
module.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_pipeline.data.aws_caller_identity.current: Reading...
module.s3_alb_logs.data.aws_caller_identity.current: Reading...
module.ecr_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/aidoctors-cluster]
module.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr_app.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]
module.s3_alb_logs.data.aws_region.current: Reading...
module.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.ecr_app.data.aws_caller_identity.current: Reading...
module.ecr_pipeline.data.aws_partition.current: Reading...
module.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]
module.ecr_app.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
aws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]
module.vpc.aws_subnet.public[1] (deposed object dff47067): Refreshing state... [id=subnet-00181454359ad7fee]
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]
module.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]
module.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-2:521538197756:cluster/aidoctors-cluster]
module.ecr_pipeline.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.ecr_pipeline.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.ecr_app.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr_app.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=aidoctors-cluster]
module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...
module.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=2281510643]
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1261215049]
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2642795832]
module.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logs]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
aws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]
aws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=aidoctors-ecs-task-role:aidoctors-ecs-task-role-policy]
aws_ecs_task_definition.app: Refreshing state... [id=aidoctors-app]
aws_ecs_task_definition.pipeline: Refreshing state... [id=aidoctors-pipeline]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]
module.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b0bc8801cf3bc23c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]
module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]
module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0894a7d5f8bcdbdef]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0ede3920777b32c6c]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]
module.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739]
module.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029162216762800000001]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-09a7c57f478f193d7]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]
module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-0b0fee6925a741f5d]
module.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0be5005f96f1578a8]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-058d551c3513cd7d4]
module.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-01ef6dce0fbb665e9]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:loadbalancer/app/aidoctors-alb/6652fc2ac194375a]
module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-YUAZASCKMEEFMFFXGN37R4GCT4]
module.alb.aws_lb_listener.this["ex-http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:listener/app/aidoctors-alb/6652fc2ac194375a/65282dea93f7061c]
module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:521538197756:secret:rds!db-cbfeed5f-8f40-443b-9729-9c3f489f3b09-uO760T]
aws_route53_record.root: Refreshing state... [id=Z07552261L3Y3JSSNSTHB_aidoctors.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecs_service.app will be created
  + resource "aws_ecs_service" "app" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = (known after apply)
      + cluster                            = "arn:aws:ecs:us-east-2:521538197756:cluster/aidoctors-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "aidoctors-app-service"
      + platform_version                   = (known after apply)
      + region                             = "us-east-2"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "aidoctors-app-service"
        }
      + tags_all                           = {
          + "Name" = "aidoctors-app-service"
        }
      + task_definition                    = "arn:aws:ecs:us-east-2:521538197756:task-definition/aidoctors-app:2"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_configuration (known after apply)

      + load_balancer {
          + container_name   = "aidoctors-app-container"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-058d551c3513cd7d4",
            ]
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_service.pipeline will be created
  + resource "aws_ecs_service" "pipeline" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = (known after apply)
      + cluster                            = "arn:aws:ecs:us-east-2:521538197756:cluster/aidoctors-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "aidoctors-pipeline-service"
      + platform_version                   = (known after apply)
      + region                             = "us-east-2"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "aidoctors-pipeline-service"
        }
      + tags_all                           = {
          + "Name" = "aidoctors-pipeline-service"
        }
      + task_definition                    = "arn:aws:ecs:us-east-2:521538197756:task-definition/aidoctors-pipeline:2"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_configuration (known after apply)

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-058d551c3513cd7d4",
            ]
          + subnets          = (known after apply)
        }
    }

  # module.alb.data.aws_partition.current[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.alb.aws_lb.this[0] will be updated in-place
  ~ resource "aws_lb" "this" {
        id                                                           = "arn:aws:elasticloadbalancing:us-east-2:521538197756:loadbalancer/app/aidoctors-alb/6652fc2ac194375a"
        name                                                         = "aidoctors-alb"
      ~ subnets                                                      = [
          - "subnet-00181454359ad7fee",
          - "subnet-07bf335ed55e1233f",
        ] -> (known after apply)
        tags                                                         = {
            "Name"                  = "aidoctors-alb"
            "terraform-aws-modules" = "alb"
        }
        # (27 unchanged attributes hidden)

      ~ subnet_mapping (known after apply)
      - subnet_mapping {
          - subnet_id            = "subnet-00181454359ad7fee" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-07bf335ed55e1233f" -> null
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.vpc.aws_nat_gateway.this[1] is tainted, so must be replaced
+/- resource "aws_nat_gateway" "this" {
      + association_id                     = (known after apply)
      ~ id                                 = "nat-0ede3920777b32c6c" -> (known after apply)
      ~ network_interface_id               = "eni-0b9364c472924a5b4" -> (known after apply)
      ~ private_ip                         = "10.0.5.220" -> (known after apply)
      + public_ip                          = (known after apply)
      ~ secondary_allocation_ids           = [] -> (known after apply)
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0b0bc8801cf3bc23c" -> (known after apply)
        tags                               = {
            "Name" = "aidoctors-vpc"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[1] (deposed object 835aab7e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_nat_gateway" "this" {
      - allocation_id                      = "eipalloc-038f6ff47eba184f5" -> null
      - association_id                     = "eipassoc-03c8f3b28f269f523" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-060795adfd71d2087" -> null
      - network_interface_id               = "eni-0dbd126d96cce631f" -> null
      - private_ip                         = "10.0.4.145" -> null
      - public_ip                          = "3.147.233.242" -> null
      - region                             = "us-east-2" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-00181454359ad7fee" -> null
      - tags                               = {
          - "Name" = "aidoctors-vpc"
        } -> null
      - tags_all                           = {
          - "Name" = "aidoctors-vpc"
        } -> null
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                          = "r-rtb-09431dd1309dfe33a1080289494"
      ~ nat_gateway_id              = "nat-060795adfd71d2087" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = "rtb-09431dd1309dfe33a"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = "rtb-0f7d82a180ace47f4"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] (deposed object ee19b1ca) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-08ce7f62a5a36df2c" -> null
      - region         = "us-east-2" -> null
      - route_table_id = "rtb-0f7d82a180ace47f4" -> null
      - subnet_id      = "subnet-00181454359ad7fee" -> null
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                                       = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                                         = "vpc-05686e7dc52f8f6df"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                                       = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                                         = "vpc-05686e7dc52f8f6df"
    }

  # module.vpc.aws_subnet.public[1] (deposed object dff47067) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-2:521538197756:subnet/subnet-00181454359ad7fee" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2b" -> null
      - availability_zone_id                           = "use2-az2" -> null
      - cidr_block                                     = "10.0.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-00181454359ad7fee" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "521538197756" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - region                                         = "us-east-2" -> null
      - tags                                           = {
          - "Name" = "aidoctors-vpc"
        } -> null
      - tags_all                                       = {
          - "Name" = "aidoctors-vpc"
        } -> null
      - vpc_id                                         = "vpc-05686e7dc52f8f6df" -> null
        # (4 unchanged attributes hidden)
    }

  # module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enhanced_monitoring" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "monitoring.rds.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.db.module.db_instance.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be updated in-place
  ~ resource "aws_db_instance" "this" {
        id                                    = "db-YUAZASCKMEEFMFFXGN37R4GCT4"
      ~ monitoring_interval                   = 0 -> 60
        tags                                  = {
            "Name" = "aidoctors-postgres"
        }
        # (74 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be updated in-place
  ~ resource "aws_iam_role" "enhanced_monitoring" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "aidoctors-rds-monitoring-role"
        name                  = "aidoctors-rds-monitoring-role"
        tags                  = {
            "Name" = "aidoctors-postgres"
        }
        # (11 unchanged attributes hidden)
    }

  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "aidoctors-rds-monitoring-role"
    }

Plan: 8 to add, 4 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.vpc.aws_route_table_association.public[1] (deposed object ee19b1ca): Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]%0Aaws_cloudwatch_log_group.ecs_app: Refreshing state... [id=/ecs/aidoctors-app]%0Amodule.ecr_app.data.aws_partition.current: Reading...%0Amodule.vpc.aws_nat_gateway.this[1] (deposed object 835aab7e): Refreshing state... [id=nat-060795adfd71d2087]%0Aaws_cloudwatch_log_group.ecs_datapipeline: Refreshing state... [id=/ecs/aidoctors-datapipeline]%0Amodule.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z07552261L3Y3JSSNSTHB]%0Amodule.s3_alb_logs.data.aws_partition.current: Reading...%0Amodule.ecr_pipeline.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]%0Amodule.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecr_pipeline.data.aws_caller_identity.current: Reading...%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Reading...%0Amodule.ecr_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/aidoctors-cluster]%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr_app.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.s3_alb_logs.data.aws_region.current: Reading...%0Amodule.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]%0Amodule.ecr_app.data.aws_caller_identity.current: Reading...%0Amodule.ecr_pipeline.data.aws_partition.current: Reading...%0Amodule.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]%0Amodule.ecr_app.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Aaws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]%0Amodule.vpc.aws_subnet.public[1] (deposed object dff47067): Refreshing state... [id=subnet-00181454359ad7fee]%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]%0Amodule.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-2:521538197756:cluster/aidoctors-cluster]%0Amodule.ecr_pipeline.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.ecr_pipeline.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.ecr_app.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr_app.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=aidoctors-cluster]%0Amodule.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=2281510643]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1261215049]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2642795832]%0Amodule.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Aaws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]%0Aaws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=aidoctors-ecs-task-role:aidoctors-ecs-task-role-policy]%0Aaws_ecs_task_definition.app: Refreshing state... [id=aidoctors-app]%0Aaws_ecs_task_definition.pipeline: Refreshing state... [id=aidoctors-pipeline]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]%0Amodule.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b0bc8801cf3bc23c]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]%0Amodule.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]%0Amodule.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]%0Amodule.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]%0Amodule.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0894a7d5f8bcdbdef]%0Amodule.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]%0Amodule.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]%0Amodule.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0ede3920777b32c6c]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]%0Amodule.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739]%0Amodule.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]%0Amodule.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029162216762800000001]%0Amodule.alb.aws_security_group.this[0]: Refreshing state... [id=sg-09a7c57f478f193d7]%0Amodule.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]%0Amodule.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-0b0fee6925a741f5d]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0be5005f96f1578a8]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-058d551c3513cd7d4]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-01ef6dce0fbb665e9]%0Amodule.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:loadbalancer/app/aidoctors-alb/6652fc2ac194375a]%0Amodule.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-YUAZASCKMEEFMFFXGN37R4GCT4]%0Amodule.alb.aws_lb_listener.this["ex-http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:listener/app/aidoctors-alb/6652fc2ac194375a/65282dea93f7061c]%0Amodule.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:521538197756:secret:rds!db-cbfeed5f-8f40-443b-9729-9c3f489f3b09-uO760T]%0Aaws_route53_record.root: Refreshing state... [id=Z07552261L3Y3JSSNSTHB_aidoctors.com_A]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A+/- create replacement and then destroy%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecs_service.app will be created%0A  + resource "aws_ecs_service" "app" {%0A      + arn                                = (known after apply)%0A      + availability_zone_rebalancing      = (known after apply)%0A      + cluster                            = "arn:aws:ecs:us-east-2:521538197756:cluster/aidoctors-cluster"%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 0%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "aidoctors-app-service"%0A      + platform_version                   = (known after apply)%0A      + region                             = "us-east-2"%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Name" = "aidoctors-app-service"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "aidoctors-app-service"%0A        }%0A      + task_definition                    = "arn:aws:ecs:us-east-2:521538197756:task-definition/aidoctors-app:2"%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + deployment_configuration (known after apply)%0A%0A      + load_balancer {%0A          + container_name   = "aidoctors-app-container"%0A          + container_port   = 80%0A          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739"%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-058d551c3513cd7d4",%0A            ]%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_service.pipeline will be created%0A  + resource "aws_ecs_service" "pipeline" {%0A      + arn                                = (known after apply)%0A      + availability_zone_rebalancing      = (known after apply)%0A      + cluster                            = "arn:aws:ecs:us-east-2:521538197756:cluster/aidoctors-cluster"%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 0%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "aidoctors-pipeline-service"%0A      + platform_version                   = (known after apply)%0A      + region                             = "us-east-2"%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Name" = "aidoctors-pipeline-service"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "aidoctors-pipeline-service"%0A        }%0A      + task_definition                    = "arn:aws:ecs:us-east-2:521538197756:task-definition/aidoctors-pipeline:2"%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + deployment_configuration (known after apply)%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-058d551c3513cd7d4",%0A            ]%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # module.alb.data.aws_partition.current[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_partition" "current" {%0A      + dns_suffix         = (known after apply)%0A      + id                 = (known after apply)%0A      + partition          = (known after apply)%0A      + reverse_dns_prefix = (known after apply)%0A    }%0A%0A  # module.alb.aws_lb.this[0] will be updated in-place%0A  ~ resource "aws_lb" "this" {%0A        id                                                           = "arn:aws:elasticloadbalancing:us-east-2:521538197756:loadbalancer/app/aidoctors-alb/6652fc2ac194375a"%0A        name                                                         = "aidoctors-alb"%0A      ~ subnets                                                      = [%0A          - "subnet-00181454359ad7fee",%0A          - "subnet-07bf335ed55e1233f",%0A        ] -> (known after apply)%0A        tags                                                         = {%0A            "Name"                  = "aidoctors-alb"%0A            "terraform-aws-modules" = "alb"%0A        }%0A        # (27 unchanged attributes hidden)%0A%0A      ~ subnet_mapping (known after apply)%0A      - subnet_mapping {%0A          - subnet_id            = "subnet-00181454359ad7fee" -> null%0A            # (4 unchanged attributes hidden)%0A        }%0A      - subnet_mapping {%0A          - subnet_id            = "subnet-07bf335ed55e1233f" -> null%0A            # (4 unchanged attributes hidden)%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[1] is tainted, so must be replaced%0A+/- resource "aws_nat_gateway" "this" {%0A      + association_id                     = (known after apply)%0A      ~ id                                 = "nat-0ede3920777b32c6c" -> (known after apply)%0A      ~ network_interface_id               = "eni-0b9364c472924a5b4" -> (known after apply)%0A      ~ private_ip                         = "10.0.5.220" -> (known after apply)%0A      + public_ip                          = (known after apply)%0A      ~ secondary_allocation_ids           = [] -> (known after apply)%0A      ~ secondary_private_ip_address_count = 0 -> (known after apply)%0A      ~ secondary_private_ip_addresses     = [] -> (known after apply)%0A      ~ subnet_id                          = "subnet-0b0bc8801cf3bc23c" -> (known after apply)%0A        tags                               = {%0A            "Name" = "aidoctors-vpc"%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[1] (deposed object 835aab7e) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_nat_gateway" "this" {%0A      - allocation_id                      = "eipalloc-038f6ff47eba184f5" -> null%0A      - association_id                     = "eipassoc-03c8f3b28f269f523" -> null%0A      - connectivity_type                  = "public" -> null%0A      - id                                 = "nat-060795adfd71d2087" -> null%0A      - network_interface_id               = "eni-0dbd126d96cce631f" -> null%0A      - private_ip                         = "10.0.4.145" -> null%0A      - public_ip                          = "3.147.233.242" -> null%0A      - region                             = "us-east-2" -> null%0A      - secondary_allocation_ids           = [] -> null%0A      - secondary_private_ip_address_count = 0 -> null%0A      - secondary_private_ip_addresses     = [] -> null%0A      - subnet_id                          = "subnet-00181454359ad7fee" -> null%0A      - tags                               = {%0A          - "Name" = "aidoctors-vpc"%0A        } -> null%0A      - tags_all                           = {%0A          - "Name" = "aidoctors-vpc"%0A        } -> null%0A    }%0A%0A  # module.vpc.aws_route.private_nat_gateway[1] will be updated in-place%0A  ~ resource "aws_route" "private_nat_gateway" {%0A        id                          = "r-rtb-09431dd1309dfe33a1080289494"%0A      ~ nat_gateway_id              = "nat-060795adfd71d2087" -> (known after apply)%0A        # (18 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + region         = "us-east-2"%0A      + route_table_id = "rtb-09431dd1309dfe33a"%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + region         = "us-east-2"%0A      + route_table_id = "rtb-0f7d82a180ace47f4"%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public[1] (deposed object ee19b1ca) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_route_table_association" "public" {%0A      - id             = "rtbassoc-08ce7f62a5a36df2c" -> null%0A      - region         = "us-east-2" -> null%0A      - route_table_id = "rtb-0f7d82a180ace47f4" -> null%0A      - subnet_id      = "subnet-00181454359ad7fee" -> null%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-2b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-2"%0A      + tags                                           = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                                         = "vpc-05686e7dc52f8f6df"%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-2b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-2"%0A      + tags                                           = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                                         = "vpc-05686e7dc52f8f6df"%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] (deposed object dff47067) will be destroyed%0A  # (left over from a partially-failed replacement of this instance)%0A  - resource "aws_subnet" "public" {%0A      - arn                                            = "arn:aws:ec2:us-east-2:521538197756:subnet/subnet-00181454359ad7fee" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-2b" -> null%0A      - availability_zone_id                           = "use2-az2" -> null%0A      - cidr_block                                     = "10.0.4.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_lni_at_device_index                     = 0 -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-00181454359ad7fee" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "521538197756" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - region                                         = "us-east-2" -> null%0A      - tags                                           = {%0A          - "Name" = "aidoctors-vpc"%0A        } -> null%0A      - tags_all                                       = {%0A          - "Name" = "aidoctors-vpc"%0A        } -> null%0A      - vpc_id                                         = "vpc-05686e7dc52f8f6df" -> null%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_iam_policy_document" "enhanced_monitoring" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRole",%0A            ]%0A%0A          + principals {%0A              + identifiers = [%0A                  + "monitoring.rds.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.db.module.db_instance.data.aws_partition.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_partition" "current" {%0A      + dns_suffix         = (known after apply)%0A      + id                 = (known after apply)%0A      + partition          = (known after apply)%0A      + reverse_dns_prefix = (known after apply)%0A    }%0A%0A  # module.db.module.db_instance.aws_db_instance.this[0] will be updated in-place%0A  ~ resource "aws_db_instance" "this" {%0A        id                                    = "db-YUAZASCKMEEFMFFXGN37R4GCT4"%0A      ~ monitoring_interval                   = 0 -> 60%0A        tags                                  = {%0A            "Name" = "aidoctors-postgres"%0A        }%0A        # (74 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be updated in-place%0A  ~ resource "aws_iam_role" "enhanced_monitoring" {%0A      ~ assume_role_policy    = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "sts:AssumeRole"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Service = "monitoring.rds.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A        id                    = "aidoctors-rds-monitoring-role"%0A        name                  = "aidoctors-rds-monitoring-role"%0A        tags                  = {%0A            "Name" = "aidoctors-postgres"%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "aidoctors-rds-monitoring-role"%0A    }%0A%0APlan: 8 to add, 4 to change, 4 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @TerryTian21, Action: `pull_request`, Workflow: `Terraform PR Check`*